
Процедура ОбработкаПроведения(Отказ, Режим)
	
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
	Движения.СтоимостьТоваров.Записывать = Истина;
	Движения.Управленческий.Записывать = Истина;
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ПродажаПереченьНоменклатуры.Количество) КАК КоличествоВДокументе,
		|	ПродажаПереченьНоменклатуры.Цена,
		|	СУММА(ПродажаПереченьНоменклатуры.Сумма) КАК СуммаВДокументе,
		|	ПродажаПереченьНоменклатуры.Номенклатура,
		|	ПродажаПереченьНоменклатуры.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры
		|ПОМЕСТИТЬ НоменклатураДокумента
		|ИЗ
		|	Документ.Продажа.ПереченьНоменклатуры КАК ПродажаПереченьНоменклатуры
		|ГДЕ
		|	ПродажаПереченьНоменклатуры.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажаПереченьНоменклатуры.Номенклатура,
		|	ПродажаПереченьНоменклатуры.Номенклатура.ВидНоменклатуры,
		|	ПродажаПереченьНоменклатуры.Цена";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Запрос2 = Новый Запрос;
	Запрос2.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос2.Текст = "ВЫБРАТЬ
	                |	НоменклатураДокумента.Номенклатура,
	                |	НоменклатураДокумента.ВидНоменклатуры,
	                |	НоменклатураДокумента.КоличествоВДокументе,
	                |	НоменклатураДокумента.СуммаВДокументе,
	                |	ЕСТЬNULL(СтоимостьТоваровОстатки.СтоимостьОстаток, 0) КАК Стоимость,
	                |	ЕСТЬNULL(ОстаткиТоваровОстатки.КоличествоОстаток, 0) КАК Количество
	                |ИЗ
	                |	НоменклатураДокумента КАК НоменклатураДокумента
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьТоваров.Остатки(
	                |				,
	                |				Товар В
	                |					(ВЫБРАТЬ
	                |						НоменклатураДокумента.Номенклатура
	                |					ИЗ
	                |						НоменклатураДокумента)) КАК СтоимостьТоваровОстатки
	                |		ПО НоменклатураДокумента.Номенклатура = СтоимостьТоваровОстатки.Товар
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки(
	                |				,
	                |				Товар В
	                |					(ВЫБРАТЬ
	                |						НоменклатураДокумента.Номенклатура
	                |					ИЗ
	                |						НоменклатураДокумента)) КАК ОстаткиТоваровОстатки
	                |		ПО НоменклатураДокумента.Номенклатура = ОстаткиТоваровОстатки.Товар";
	
					
	Движения.ОстаткиТоваров.Записать();
	Движения.СтоимостьТоваров.Записать();
	РезультатЗапроса = Запрос2.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Количество = 0 Тогда 
			СтоимостьТовара = 0;
		Иначе 
			СтоимостьТовара = ВыборкаДетальныеЗаписи.Стоимость / ВыборкаДетальныеЗаписи.Количество;
		КонецЕсли;
		
		
		Если ВыборкаДетальныеЗаписи.ВидНоменклатуры <> Перечисления.ВидыНоменклатуры.Услуга Тогда
			
			//регистр ОстаткиТоваров
			Движение = Движения.ОстаткиТоваров.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Товар = ВыборкаДетальныеЗаписи.Номенклатура;
			Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоВДокументе;
			
			//Регистр СтоимостьТоваров
			Движение = Движения.СтоимостьТоваров.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Товар = ВыборкаДетальныеЗаписи.Номенклатура;
			Движение.Стоимость = ВыборкаДетальныеЗаписи.КоличествоВДокументе * СтоимостьТовара;
			
			//регистр бухгалтерии Управленческий
			//первая проводка: Д 62 (Дебиторская задолженность) - К 90 (Капитал) Розничная сумма
			Движение = Движения.Управленческий.Добавить();
			Движение.СчетДт = ПланыСчетов.Основной.ДебиторскаяЗадолженность;
			Движение.СчетКт = ПланыСчетов.Основной.Капитал;
			Движение.Период = Дата;
			Движение.Сумма = ВыборкаДетальныеЗаписи.СуммаВДокументе;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Клиенты] = Клиент;
			
			//вторая проводка: Д 90 (Капитал) - К 41 (Товары) - Себестоимость
			Движение = Движения.Управленческий.Добавить();
			Движение.СчетДт = ПланыСчетов.Основной.Капитал;
			Движение.СчетКт = ПланыСчетов.Основной.Товары;
			Движение.Период = Дата;
			Движение.Сумма = СтоимостьТовара * ВыборкаДетальныеЗаписи.КоличествоВДокументе;
			Движение.КоличествоКт = ВыборкаДетальныеЗаписи.КоличествоВДокументе;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = ВыборкаДетальныеЗаписи.Номенклатура;
			
		КонецЕсли;
		
		
				
		
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Кассир = Продавец;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоВДокументе;
		Движение.Выручка = ВыборкаДетальныеЗаписи.СуммаВДокументе;
		Движение.Стоимость = ВыборкаДетальныеЗаписи.КоличествоВДокументе * СтоимостьТовара;
	КонецЦикла;
	
	Движения.Записать();
	Если Режим = РежимПроведенияДокумента.Оперативный Тогда
		Запрос3 = Новый Запрос;
		Запрос3.МенеджерВременныхТаблиц = МенеджерВТ;
		Запрос3.текст = "ВЫБРАТЬ
		                |	ОстаткиТоваровОстатки.Товар,
		                |	ОстаткиТоваровОстатки.КоличествоОстаток
		                |ИЗ
		                |	РегистрНакопления.ОстаткиТоваров.Остатки(
		                |			,
		                |			Товар В
		                |				(ВЫБРАТЬ
		                |					НоменклатураДокумента.Номенклатура
		                |				ИЗ
		                |					НоменклатураДокумента)) КАК ОстаткиТоваровОстатки
		                |ГДЕ
		                |	ОстаткиТоваровОстатки.КоличествоОстаток < 0";
		РезультатЗапроса = Запрос3.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Не хватает " + Строка(-ВыборкаДетальныеЗаписи.КоличествоОстаток) + " единиц товара " + Строка(ВыборкаДетальныеЗаписи.Товар);
			Сообщение.Сообщить();
			
			Отказ = Истина;
		КонецЦикла;
			
		
	КонецЕсли;
	
КонецПроцедуры
