
Процедура ОбработкаПроведения(Отказ, Режим)
	
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.Управленческий.Записывать = Истина;
	
	
	// приход готового букета
	Движение = Движения.ОстаткиТоваров.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Товар = Букет;
	Движение.Количество = Количество;
	
	//Д 41 (Товары)
	Движение = Движения.Управленческий.Добавить();
	Движение.СчетДт = ПланыСчетов.Основной.Товары;
	Движение.СчетКт = ПланыСчетов.Основной.Капитал;
	Движение.Период = Дата;
	Движение.Сумма = 0;
	Движение.КоличествоДт = Количество;
	Движение.СубконтоДт.Номенклатура = Букет;



	
	// расход цветков и упаковки
	
	Для Каждого ТекСтрокаСоставБукета Из СоставБукета Цикл
		//остатки товаров
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаСоставБукета.Номенклатура;
		Движение.Количество = ТекСтрокаСоставБукета.Количество;
		
		//управленческий - регистр бухгалтерии
		//К 41 (Товары)
		Движение = Движения.Управленческий.Добавить();
		Движение.СчетКт = ПланыСчетов.Основной.Товары;
		Движение.СчетДт = ПланыСчетов.Основной.Капитал;
		Движение.Период = Дата;
		Движение.Сумма = 0;
		Движение.КоличествоКт = ТекСтрокаСоставБукета.Количество;
		Движение.СубконтоКт.Номенклатура = ТекСтрокаСоставБукета.Номенклатура;
		
		
	КонецЦикла;
	
	Движения.Записать();
	
	Если Режим = РежимПроведенияДокумента.Оперативный Тогда
		Запрос2 = Новый Запрос;
		Запрос2.Текст = "ВЫБРАТЬ
		                |	СборкаБукетаСоставБукета.Товар КАК Товар,
		                |	СборкаБукетаСоставБукета.Количество КАК КоличествоВДокументе,
		                |	ОстаткиТоваровОстатки.КоличествоОстаток КАК Остаток
		                |ИЗ
		                |	Документ.СборкаБукета.СоставБукета КАК СборкаБукетаСоставБукета
		                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки КАК ОстаткиТоваровОстатки
		                |		ПО СборкаБукетаСоставБукета.Товар = ОстаткиТоваровОстатки.Товар
		                |ГДЕ
		                |	ОстаткиТоваровОстатки.КоличествоОстаток < 0";
						
		РезультатЗапроса = Запрос2.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Сообщение1 = Новый СообщениеПользователю();
			Сообщение1.Текст = "Не хватает " + Строка(ВыборкаДетальныеЗаписи.Товар) + " " + Строка(-ВыборкаДетальныеЗаписи.Остаток) + " шт.";
			Сообщение1.Сообщить();
			 
			Отказ = Истина;
		КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры
