
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// приход готового букета
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движение = Движения.ОстаткиТоваров.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Товар = Букет;
	Движение.Количество = Количество;

	// расход цветков и упаковки
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаСоставБукета Из СоставБукета Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаСоставБукета.Товар;
		Движение.Количество = ТекСтрокаСоставБукета.Количество;
	КонецЦикла;
	
	Движения.Записать();
	
	Если Режим = РежимПроведенияДокумента.Оперативный Тогда
		Запрос2 = Новый Запрос;
		Запрос2.Текст = "ВЫБРАТЬ
		                |	СборкаБукетаСоставБукета.Товар КАК Товар,
		                |	СборкаБукетаСоставБукета.Количество КАК КоличествоВДокументе,
		                |	ОстаткиТоваровОстатки.КоличествоОстаток КАК Остаток
		                |ИЗ
		                |	Документ.СборкаБукета.СоставБукета КАК СборкаБукетаСоставБукета
		                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки КАК ОстаткиТоваровОстатки
		                |		ПО СборкаБукетаСоставБукета.Товар = ОстаткиТоваровОстатки.Товар
		                |ГДЕ
		                |	ОстаткиТоваровОстатки.КоличествоОстаток < 0";
						
		РезультатЗапроса = Запрос2.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Сообщение1 = Новый СообщениеПользователю();
			Сообщение1.Текст = "Не хватает " + Строка(ВыборкаДетальныеЗаписи.Товар) + " " + Строка(-ВыборкаДетальныеЗаписи.Остаток) + " шт.";
			Сообщение1.Сообщить();
			 
			Отказ = Истина;
		КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры
