
&НаКлиенте
Процедура ОбновитьСтоимостьСУчетомСкидки()
	Скидка = Объект.Клиент.УровеньСкидки / 100;
	Объект.СтоимостьСУчетомСкидки = Объект.Стоимость * (1-Скидка);
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	Объект.СкидкаКлиенту = Объект.Клиент.УровеньСкидки;
	ОбновитьСтоимостьСУчетомСкидки();
КонецПроцедуры

&НаКлиенте
Процедура СкидкаКлиентуПриИзменении(Элемент)
	ОбновитьСтоимостьСУчетомСкидки();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтоимость()
	ОбщаяСтоимость = 0;
	Для Каждого ТекСтрока ИЗ Объект.ПереченьНоменклатуры Цикл
		// Защита от Неопределено в новых строках
		ОбщаяСтоимость = ОбщаяСтоимость + ?(ТекСтрока.Сумма = Неопределено, 0, ТекСтрока.Сумма);
	КонецЦикла;
	
	// Присваиваем напрямую на клиенте (атрибут формы)
	Объект.Стоимость = ОбщаяСтоимость;
	ОбновитьСтоимостьСУчетомСкидки();
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
	ОбновитьСтоимость();
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
	ОбновитьСтоимость();
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыНоменклатураПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена = РаботаСоСправочниками.РозничнаяЦена(Объект.Дата, СтрокаТабличнойЧасти.Номенклатура);
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
	ОбновитьСтоимость();
КонецПроцедуры