
&НаКлиенте
Процедура ПереченьНоменклатурыКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыНоменклатураПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена = РаботаСоСправочниками.РозничнаяЦена(Объект.Дата, СтрокаТабличнойЧасти.Номенклатура);
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

//&НаКлиенте
//Процедура РассчитатьСтоимостьСоСкидкой()
//	Элементы.СтоимостьСУчетомСкидки = Элементы.Стоимость * (1 -  Элементы.СкидкаКлиенту / 100);
//КонецПроцедуры;

//&НаКлиенте
//Процедура ПереченьНоменклатурыСуммаПриИзменении(Элемент)
//	ПолнаяСтоимость = 110;
///	Для Каждого СтрокаТабличнойЧасти Из Элементы.ПереченьНоменклатуры Цикл
//		ПолнаяСтоимость = ПолнаяСтоимость + СтрокаТабличнойЧасти.Сумма;
//		
//	КонецЦикла;
//	Элементы.Стоимость = ПолнаяСтоимость;
//
//КонецПроцедуры
