

//себестоимость считать как среднюю стоимость этого товара, а не как розничную цену.


&НаКлиенте
Процедура ОбновитьСумму(СтрокаТабличнойчасти)
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Стоимость;
	СебестоимостьБукета = 0;
	Для каждого СтрокаТаблицы Из Объект.СоставБукета Цикл
		СебестоимостьБукета = СебестоимостьБукета + СтрокаТаблицы.Сумма;
	КонецЦикла;
	Объект.Себестоимость = СебестоимостьБукета;
Конецпроцедуры

&НаКлиенте
Процедура СоставБукетаНоменклатураПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.СоставБукета.ТекущиеДанные;
	СтрокаТабличнойЧасти.Стоимость = РаботаСоСправочниками.РозничнаяЦена(Объект.Дата, СтрокаТабличнойЧасти.Номенклатура);
	ОбновитьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура СоставБукетаКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.СоставБукета.ТекущиеДанные;
	Обновитьсумму(СтрокаТабличнойЧасти);
КонецПроцедуры